# User
user.login.empty                       = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
user.login.size                        = L'identifiant ne peut avoir que 30 caract\u00e8res au maximum.
user.password.empty                    = Il est obligatoire de renseigner le mot de passe.
user.password.size                     = Le mot de passe ne peut avoir que 100 caract\u00e8res au maximum.
user.lastName.empty                    = Le nom de famille de l'utilisateur doit \u00eatre renseign\u00e9.
user.lastName.size                     = Le nom de famille de l'utilisateur ne peut avoir que 50 caract\u00e8res au maximum.
user.firstName.empty                   = Le pr\u00e9nom de l'utilisateur doit \u00eatre renseign\u00e9.
user.firstName.size                    = Le pr\u00e9nom de l'utilisateur ne peut avoir que 50 caract\u00e8res au maximum.
user.email.size                        = L'adresse mail est trop longue. Elle ne doit pas contenir plus de 100 caract\u00e8res.
user.email.empty                       = L'adresse email ne peut \u00eatre vide.
user.email.format                      = L'adresse mail est trop longue. Elle ne doit pas contenir plus de 100 caract\u00e8res.
user.role.null                         = Un role doit \u00eatre associ\u00e9e \u00e0 l'utilisateur.

# Role
role.roleName.empty                    = Le nom du role doit \u00eatre renseign\u00e9.
role.roleName.size                     = Le nom du role ne peut avoir que 15 caract\u00e8res au maximum.

# UserEple
userEple.userId.null                   = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
userEple.epleId.null                   = L'identifiant de l'EPLE doit \u00eatre renseign\u00e9.

# Eple
eple.rne.empty                         = Le code rne doit \u00eatre renseign\u00e9.
eple.rne.size                          = Le code rne doit comport\u00e9 8 caract\u00e8res.
eple.epleName.empty                    = Le nom de l'eple doit \u00eatre renseign\u00e9.
eple.epleName.size                     = Le nom de l'eple doit comport\u00e9 100 caract\u00e8res maximum.
eple.departmentId.null                 = L'identifiant du département associ\u00e9 à l'EPLE doit \u00eatre renseign\u00e9.
eple.cityId.null                       = L'identifiant de la ville associ\u00e9 à l'EPLE doit \u00eatre renseign\u00e9.

# City
city.zipcode.empty                     = Le code postal doit \u00eatre renseign\u00e9.
city.zipCode.size                      = Le code postal doit \u00eatre constitu\u00e9 de 5 chiffres.
city.name.empty                        = Le nom de la ville doit \u00eatre renseign\u00e9.
city.name.size                         = Le nom de la ville doit avoir 100 caract\u00e8res au maximum.
city.departmentId.null                 = L'identifiant du département associ\u00e9 à la ville doit \u00eatre renseign\u00e9.

# Department
department.code.empty                  = Le code du d\u00e9partement doit \u00eatre renseign\u00e9.
department.code.size                   = Le code du d\u00e9partement doit comport\u00e9 3 caract\u00e8res.
department.departmentName.empty        = Le nom du d\u00e9partement doit \u00eatre renseign\u00e9.
department.departmentName.size         = Le nom du d\u00e9partement ne peut avoir que 50 caract\u00e8res au maximum.

# Book
book.ean.empty                         = L'ean du livre doit \u00eatre renseign\u00e9.
book.ean.size                          = L'ean du livre doit comport\u00e9 13 caract\u00e8res.
book.title.empty                       = Le titre du livre doit \u00eatre renseign\u00e9.
book.title.size                        = Le titre du livre ne peut avoir que 150 caract\u00e8res au maximum.
book.author.empty                      = L'auteur du livre doit \u00eatre renseign\u00e9.
book.author.size                       = L'auteur du livre ne peut avoir que 150 caract\u00e8res au maximum.
book.bookStatusId.null                 = L'identifiant du statut du livre doit \u00eatre renseign\u00e9.
book.prescriptionId.null               = L'identifiant de la prescription doit \u00eatre renseign\u00e9.

# BookStatus
bookStatus.name.empty                  = Le nom du statut d'un livre doit \u00eatre renseign\u00e9.
bookStatus.name.size                   = Le nom du statut d'un livre ne peut avoir que 50 caract\u00e8res au maximum.

# Prescription
prescription.prescriptionName.empty    = Le nom de la prescription doit \u00eatre renseign\u00e9.
prescription.prescriptionName.size     = Le nom de la prescription ne peut avoir que 150 caract\u00e8res au maximum.
prescription.creationDate.null         = La date de cr\u00e9ation de la prescription doit \u00eatre renseign\u00e9.
prescription.userId.null               = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
prescription.purchaseDeadline.null     = La date limite d'achat des livres de la prescription doit \u00eatre renseign\u00e9.

# ProcessingBook
processingBook.userId.null             = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
processingBook.bookId.null             = L'identifiant du livre doit \u00eatre renseign\u00e9.
processingBook.processingStatus.null   = Le status du traitement du livre doit \u00eatre renseign\u00e9.

# ProcessingPrescription
processingPrescription.userId.null     = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
processingPrescription.prescriptionId.null     = L'identifiant de la prescription doit \u00eatre renseign\u00e9.




