# All DAO
permissionDenied                                                    = Un probl\u00e8me de droits d'acc\u00e8s \u00e0 la base de donn\u00e9es a \u00e9t\u00e9 d\u00e9tect\u00e9.
dataAccessResourceFailure                                           = La connexion \u00e0 la base de donn\u00e9es a \u00e9chou\u00e9.
dataAccess                                                          = Un probl\u00e8me technique au niveau de la base de donn\u00e9es est survenu.


# RoleDao
roleDao.getRole.notFound                                            = Le role n'a pas \u00e9t\u00e9 trouv\u00e9e.
roleDao.updateRole.notFound                                         = Le role \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du role n'a pas pu \u00eatre r\u00e9alis\u00e9e.
roleDao.updateRole.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
roleDao.insertRole.duplicate                                        = Le role existe d\u00e9j\u00e0 avec cet identifiant.
roleDao.insertRole.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation du role n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
roleDao.deleteRole.notFound                                         = Le role \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# UserDao
UserDao.getUser.notFound                                            = L'utilisateur n'a pas \u00e9t\u00e9 trouv\u00e9.
UserDao.getUserByLogin.notFound                                     = L'utilisateur n'a pas \u00e9t\u00e9 trouv\u00e9.
UserDao.updateUser.notFound                                         = L'utilisateur \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour de l'utilisateur n'a pu \u00eatre faite.
UserDao.updateUser.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
userDao.insertUser.duplicate                                        = Un utilisateur existe d\u00e9j\u00e0 avec cet identifiant.
userDao.insertUser.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de l'utilisateur n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
userDao.deleteUser.notFound                                         = L'utilisateur \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# UserEpleDao
UserEpleDao.getUserEpleForUser.notFound                             = Aucun couple utilisateur-eple n'a \u00e9t\u00e9 trouv\u00e9 pour l'utilisateur.
userEpleDaoImpl.insertUserEple.duplicate                            = Ce couple utilisateur-eple existe d\u00e9j\u00e0.
userEpleDaoImpl.insertUserEple.integrityViolation                   = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation du couple utilisateur-eple n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
userEpleDaoImpl.deleteUserEple.notFound                             = Le couple utilisateur-eple \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# CityDao
cityDao.getCity.notFound                                            = La ville n'a pas \u00e9t\u00e9 trouv\u00e9.
cityDao.updateCity.NotFound                                         = La ville \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour de la ville n'a pas pu \u00eatre r\u00e9alis\u00e9e.
cityDao.updateCity.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
cityDao.insertCity.duplicate                                        = Une ville existe d\u00e9j\u00e0 avec cet identifiant.
cityDao.insertCity.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de la ville n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
cityDao.deleteCity.notFound                                         = La ville \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# DepartmentDao
departmentDao.getDepartment.notFound                                = Le d\u00e9partement n'a pas \u00e9t\u00e9 trouv\u00e9e.
departmentDao.updateDepartment.NotFound                             = Le d\u00e9partement \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du d\u00e9partement n'a pas pu \u00eatre r\u00e9alis\u00e9e.
departmentDao.updateDepartment.integrityViolation                   = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
departmentDao.insertDepartment.duplicate                            = Un d\u00e9partement existe d\u00e9j\u00e0 avec cet identifiant.
departmentDao.insertDepartment.integrityViolation                   = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation du d\u00e9partement n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
departmentDao.deleteDepartment.notFound                             = Le d\u00e9partement \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# EpleDao
epleDao.getEple.notFound                                            = L'eple n'a pas \u00e9t\u00e9 trouv\u00e9.
epleDao.updateEple.NotFound                                         = L'eple \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour de l'eple n'a pas pu \u00eatre r\u00e9alis\u00e9e.
epleDao.updateEple.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
epleDao.insertEple.duplicate                                        = Un eple existe d\u00e9j\u00e0 avec cet identifiant.
epleDao.insertEple.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de l'eple n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
epleDao.deleteEple.notFound                                         = L'eple \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# BookStatusDao
bookStatusDao.getBookStatus.notFound                                = Le statut de livre n'a pas \u00e9t\u00e9 trouv\u00e9.
bookStatusDao.updateBookStatus.NotFound                             = Le statut de livre \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du statut de livre n'a pas pu \u00eatre r\u00e9alis\u00e9e.
bookStatusDao.updateBookStatus.integrityViolation                   = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
bookStatusDao.insertBookStatus.duplicate                            = Un statut de livre existe d\u00e9j\u00e0 avec cet identifiant.
bookStatusDao.insertBookStatus.integrityViolation                   = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de statut de livre n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
bookStatusDao.deleteBookStatus.notFound                             = Le statut de livre \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# ProcessingBookDao
processingBookDao.getProcessingBook.notFound                        = Le traitement de livre n'a pas \u00e9t\u00e9 trouv\u00e9.
processingBookDao.updateProcessingBook.NotFound                     = Le traitement de livre \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du traitement de livre n'a pas pu \u00eatre r\u00e9alis\u00e9e.
processingBookDao.updateProcessingBook.integrityViolation           = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
processingBookDao.insertProcessingBook.duplicate                    = Un traitement de livre existe d\u00e9j\u00e0 avec cet identifiant.
processingBookDao.insertProcessingBook.integrityViolation           = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de traitement de livre n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
processingBookDao.deleteProcessingBook.notFound                     = Le traitement de livre \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# ProcessingPrescriptionDao
processingPrescriptionDao.getProcessingPrescription.notFound        = Le traitement de prescription n'a pas \u00e9t\u00e9 trouv\u00e9.
processingPrescriptionDao.updateProcessingPrescription.NotFound     = Le traitement de prescription \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du traitement de prescription n'a pas pu \u00eatre r\u00e9alis\u00e9e.
processingPrescriptionDao.updateProcessingPrescription.integrityViolation = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
processingPrescriptionDao.insertProcessingPrescription.duplicate    = Un traitement de prescrition existe d\u00e9j\u00e0 avec cet identifiant.
processingPrescriptionDao.insertProcessingPrescription.integrityViolation = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation de traitement de prescription n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
processingPrescriptionDao.deleteProcessingPrescription.notFound     = Le traitement de prescription \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

# BookDao
bookDao.getBook.notFound                                            = Le livre n'a pas \u00e9t\u00e9 trouv\u00e9.
bookDao.updateBook.NotFound                                         = Le livre \u00e0 modifier n'a pas \u00e9t\u00e9 trouv\u00e9. La mise \u00e0 jour du livre n'a pas pu \u00eatre r\u00e9alis\u00e9e.
bookDao.updateBook.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la mise \u00e0 jour n'a pu \u00eatre faite.
bookDao.insertBook.duplicate                                        = Un livre existe d\u00e9j\u00e0 avec cet identifiant.
bookDao.insertBook.integrityViolation                               = Les donn\u00e9es n'\u00e9tant pas conformes, la cr\u00e9ation du livre n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.
bookDao.deleteBook.notFound                                         = Le livre \u00e0 supprimer n'a pas \u00e9t\u00e9 trouv\u00e9e. La suppression n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e.

